---
kind: method
id: M:Autodesk.Revit.DB.LayerModifier.#ctor
source: html/94da0706-5d1e-1704-fc94-9398f53ade5d.htm
---
# Autodesk.Revit.DB.LayerModifier.#ctor Method

Constructs a new LayerModifier with default values.

## Syntax (C#)
```csharp
public LayerModifier()
```